# 4.6 Combining Data  Part 2

### This script contains the following:
1. Importing libraries
2. Importing data
3. Merging data sets
4. Exporting large merged data set

### 1. Importing Libraries

In [1]:
import pandas as pd
import numpy as nd
import os

### 2. Importing Data

In [2]:
# 3) Creating a path for importing data.

path = r'C:\Users\keely\Documents\Courses\CareerFoundry\Immersion\Achievement 4 - Python\01-2023 Instacart Basket Analysis'

In [3]:
# 3) Importing merged dataset.

# orders_products_combined.pkl is not a merged data set of orders and products but of orders and order_products_prior 
# (in the Original Data folder). We will merge orders (a merged file or orders and order_products_prior) with
# the cleaned products data set later in this script.

df_ords_prior_merged = pd.read_pickle(os.path.join(path, '02 Data', 'Prepared Data', 'orders_products_combined.pkl'))

In [4]:
# Importing clean products data set.

df_prods_clean = pd.read_csv(os.path.join(path, '02 Data', 'Prepared Data', 'products_checked.csv'))

In [6]:
# 4) Checking shape of merged dataframe. This is the shape of the large data set before being merged with products.

df_ords_prior_merged.shape

(32434489, 11)

In [7]:
df_ords_prior_merged.head()

,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_since_prior_order,new_customer,product_id,add_to_cart_order,reordered,_merge
0,2539329,1,1,2,8,NaN,True,196,1,0,both
1,2539329,1,1,2,8,NaN,True,14084,2,0,both
2,2539329,1,1,2,8,NaN,True,12427,3,0,both
3,2539329,1,1,2,8,NaN,True,26088,4,0,both
4,2539329,1,1,2,8,NaN,True,26405,5,0,both

In [8]:
df_prods_clean.shape

(49672, 6)

In [9]:
df_prods_clean.head()

,Unnamed: 0,product_id,product_name,aisle_id,department_id,prices
0,0,1,Chocolate Sandwich Cookies,61,19,5.8
1,1,2,All-Seasons Salt,104,13,9.3
2,2,3,Robust Golden Unsweetened Oolong Tea,94,7,4.5
3,3,4,Smart Ones Classic Favorites Mini Rigatoni Wit...,38,1,10.5
4,4,5,Green Chile Anytime Sauce,5,13,4.3

In [10]:
# Dropping '_merge' column from df_ords_prods_merged dataframe.

df_ords_prior_merged = df_ords_prior_merged.drop(columns = ['_merge'])

In [13]:
# Rechecking df_ords_prods_merged shape.

df_ords_prior_merged.shape

(32434489, 10)

In [14]:
# Checking products data set to see how best to merge with combined pickle file.

df_prods_clean.head()

,Unnamed: 0,product_id,product_name,aisle_id,department_id,prices
0,0,1,Chocolate Sandwich Cookies,61,19,5.8
1,1,2,All-Seasons Salt,104,13,9.3
2,2,3,Robust Golden Unsweetened Oolong Tea,94,7,4.5
3,3,4,Smart Ones Classic Favorites Mini Rigatoni Wit...,38,1,10.5
4,4,5,Green Chile Anytime Sauce,5,13,4.3

In [15]:
df_prods_clean.shape

(49672, 6)

In [16]:
df_prods_clean = df_prods_clean.drop(columns = ['Unnamed: 0'])

# The code below did not work. Keeping it just in case:
# df_prods_clean.drop(columns = {'Unnamed: 0'}, inplace = True)

In [17]:
df_prods_clean.head()

,product_id,product_name,aisle_id,department_id,prices
0,1,Chocolate Sandwich Cookies,61,19,5.8
1,2,All-Seasons Salt,104,13,9.3
2,3,Robust Golden Unsweetened Oolong Tea,94,7,4.5
3,4,Smart Ones Classic Favorites Mini Rigatoni Wit...,38,1,10.5
4,5,Green Chile Anytime Sauce,5,13,4.3

In [18]:
df_ords_prior_merged.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 32434489 entries, 0 to 32434488
Data columns (total 10 columns):
 #   Column                  Dtype
---  ------                  -----
 0   order_id                object
 1   user_id                 object
 2   order_number            int16
 3   orders_day_of_week      int8
 4   order_hour_of_day       int8
 5   days_since_prior_order  float16
 6   new_customer            bool
 7   product_id              int32
 8   add_to_cart_order       int16
 9   reordered               int8
dtypes: bool(1), float16(1), int16(2), int32(1), int8(3), object(2)
memory usage: 1.1+ GB

In [19]:
df_prods_clean.dtypes

product_id         int64
product_name      object
aisle_id           int64
department_id      int64
prices           float64
dtype: object

In [20]:
# Viewing maximum value in each df_prods_clean column to determine best data type change. Data type changes
# are to ensure smooth and fast dataframe merges.

df_prods_clean['aisle_id'].max()

134

In [21]:
df_prods_clean['department_id'].max()

21

In [22]:
df_prods_clean['prices'].max()

99999.0

In [23]:
# Change types for df_prods_clean, the data set from products_checked.csv created in task 4.5.

df_prods_clean['product_id']=df_prods_clean['product_id'].astype('int32')

df_prods_clean['aisle_id']=df_prods_clean['aisle_id'].astype('int16')

df_prods_clean['department_id']=df_prods_clean['department_id'].astype('int8')

df_prods_clean['prices']=df_prods_clean['prices'].astype('float32')

In [24]:
df_prods_clean.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 49672 entries, 0 to 49671
Data columns (total 5 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   product_id     49672 non-null  int32
 1   product_name   49672 non-null  object
 2   aisle_id       49672 non-null  int16
 3   department_id  49672 non-null  int8
 4   prices         49672 non-null  float32
dtypes: float32(1), int16(1), int32(1), int8(1), object(1)
memory usage: 921.8+ KB

### 3. Merging Data Sets

In [25]:
# 5) Merging df_ords_prior_merged and df_prods_clean. 

# I previously performed a left merge. An inner merge resulted in records deleted from df_ords_prods_merged because not all 
# products in this large file had matching product_ids. Later, an inner merged will be performed when 



# df_ords_prods_outer = df_ords_prior_merged.merge(df_prods_clean, on = ['product_id'], how = 'outer', indicator = True)

# Left:
# df_ords_prods_left = pd.merge(df_ords_prods_merged, df_prods_clean, on = ['product_id'], how = 'left')

In [26]:
# df_ords_prods_outer['_merge'].value_counts()

both          32404859
left_only        30200
right_only          11
Name: _merge, dtype: int64

In [27]:
# Inner merge:

df_ords_prods_inner = df_ords_prior_merged.merge(df_prods_clean, on = ['product_id'], how = 'inner', indicator = True)

In [28]:
df_ords_prods_inner['_merge'].value_counts()

both          32404859
left_only            0
right_only           0
Name: _merge, dtype: int64

In [29]:
df_ords_prods_inner.head()

,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_since_prior_order,new_customer,product_id,add_to_cart_order,reordered,product_name,aisle_id,department_id,prices,_merge
0,2539329,1,1,2,8,NaN,True,196,1,0,Soda,77,7,9.0,both
1,2398795,1,2,3,7,15.0,False,196,1,1,Soda,77,7,9.0,both
2,473747,1,3,3,12,21.0,False,196,1,1,Soda,77,7,9.0,both
3,2254736,1,4,4,7,29.0,False,196,1,1,Soda,77,7,9.0,both
4,431534,1,5,4,15,28.0,False,196,1,1,Soda,77,7,9.0,both

In [31]:
# Removing _merge column from inner merged data set.

df_ords_prods_inner = df_ords_prods_inner.drop(columns = ['_merge'])

In [40]:
df_ords_prods_inner.head()

,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_since_prior_order,new_customer,product_id,add_to_cart_order,reordered,product_name,aisle_id,department_id,prices
0,2539329,1,1,2,8,NaN,True,196,1,0,Soda,77,7,9.0
1,2398795,1,2,3,7,15.0,False,196,1,1,Soda,77,7,9.0
2,473747,1,3,3,12,21.0,False,196,1,1,Soda,77,7,9.0
3,2254736,1,4,4,7,29.0,False,196,1,1,Soda,77,7,9.0
4,431534,1,5,4,15,28.0,False,196,1,1,Soda,77,7,9.0

In [41]:
df_ords_prods_inner.shape

(32404859, 14)

#### 6) Merge columns were added in the merges above.

### 4. Exporting Large Merged Data Set

In [43]:
# 7) Export this new merged file.

df_ords_prods_inner.to_pickle(os.path.join(path, '02 Data','Prepared Data', 'orders_products_inner_merged.pkl'))